source/build/package-templates/hdn-itk-documentation/hdn-itk-documentation/srv/hdn-itk-documentation/itk/docs/samples/Q21.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header xmlns:local="local-namespace-uri">
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:queryPatientDemographics-v1-0</wsa:Action>
		<wsa:To>__SENDTO__</wsa:To>
		<local:LocalHeaderElement>Local_Data_To_Be_Ignored</local:LocalHeaderElement>
		<wsa:From>
			<wsa:Address>http://localhost</wsa:Address>
		</wsa:From>
		<wsa:ReplyTo>
			<wsa:Address>__REPLYTO__</wsa:Address>
		</wsa:ReplyTo>
		<wsa:FaultTo>
			<wsa:Address>__FAULTTO__</wsa:Address>
		</wsa:FaultTo>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__TIMESTAMP__</wsu:Created>
				<wsu:Expires>__EXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>TKS Server test</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<itk:DistributionEnvelope xmlns:itk="urn:nhs-itk:ns:201005" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:hl7v2="urn:hl7-org:v2xml">
			<itk:header service="urn:nhs-itk:services:201005:queryPatientDemographics-v1-0" trackingid="2D37D9CA-5223-41C7-A159-F33D5A914EB5">
				<itk:auditIdentity>
					<itk:id uri="urn:nhs-uk:identity:cfh:nic:lab:itk-demonstrator"/>
				</itk:auditIdentity>
				<itk:manifest count="1">
					<itk:manifestitem mimetype="text/xml" base64="false" compressed="false" id="uuid_E808A967-49B2-498B-AD75-1D7A0F1262D7" encrypted="false"/>
				</itk:manifest>
			</itk:header>
			<itk:payloads count="1">
				<itk:payload id="uuid_E808A967-49B2-498B-AD75-1D7A0F1262D7">
<hl7v2:QBP_Q21 xmlns:hl7v2="urn:hl7-org:v2xml">
	<hl7v2:MSH>
		<hl7v2:MSH.1>|</hl7v2:MSH.1>
		<hl7v2:MSH.2>^~\&amp;</hl7v2:MSH.2>
		<hl7v2:MSH.3>
			<hl7v2:HD.1>Saravanah</hl7v2:HD.1>
		</hl7v2:MSH.3>
		<hl7v2:MSH.4>
			<hl7v2:HD.1>ORG1</hl7v2:HD.1>
		</hl7v2:MSH.4>
		<hl7v2:MSH.5>
			<hl7v2:HD.1>PAS</hl7v2:HD.1>
		</hl7v2:MSH.5>
		<hl7v2:MSH.6>
			<hl7v2:HD.1>ORG1</hl7v2:HD.1>
		</hl7v2:MSH.6>
		<hl7v2:MSH.7>
			<hl7v2:TS.1>20100511125610+0100</hl7v2:TS.1>
		</hl7v2:MSH.7>
		<hl7v2:MSH.9>
			<hl7v2:MSG.1>QBP</hl7v2:MSG.1>
			<hl7v2:MSG.2>Q21</hl7v2:MSG.2>
			<hl7v2:MSG.3>QBP_Q21</hl7v2:MSG.3>
		</hl7v2:MSH.9>
		<hl7v2:MSH.10>04857982024975328990</hl7v2:MSH.10>
		<hl7v2:MSH.11>
			<hl7v2:PT.1>P</hl7v2:PT.1>
		</hl7v2:MSH.11>
		<hl7v2:MSH.12>
			<hl7v2:VID.1>2.4</hl7v2:VID.1>
		</hl7v2:MSH.12>
		<hl7v2:MSH.17>GBR</hl7v2:MSH.17>
		<hl7v2:MSH.19>
			<hl7v2:CE.1>EN</hl7v2:CE.1>
		</hl7v2:MSH.19>
		<hl7v2:MSH.21>ITKv1.0</hl7v2:MSH.21>
	</hl7v2:MSH>
	<hl7v2:QPD>
		<hl7v2:QPD.1>
			<hl7v2:CE.1>Q22</hl7v2:CE.1>
			<hl7v2:CE.2>Get Person Demographics</hl7v2:CE.2>
		</hl7v2:QPD.1>
		<hl7v2:QPD.2>QRY54321</hl7v2:QPD.2>
		<hl7v2:QPD.3>
			<hl7v2:QSC.1>112234</hl7v2:QSC.1>
			<hl7v2:QSC.4>METRO HOSPITAL</hl7v2:QSC.4>
		</hl7v2:QPD.3>
	</hl7v2:QPD>
	<hl7v2:RCP>
		<hl7v2:RCP.1>I</hl7v2:RCP.1>
		<hl7v2:RCP.2>
			<hl7v2:CQ.1>20</hl7v2:CQ.1>
			<hl7v2:CQ.2>
				<CE.1 xmlns="urn:hl7-org:v2xml">RD</CE.1>
			</hl7v2:CQ.2>
		</hl7v2:RCP.2>
	</hl7v2:RCP>
</hl7v2:QBP_Q21>
				</itk:payload>
			</itk:payloads>
		</itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>
